"125 ContributorsTranslationsEspañolPortuguêsNederlandsΕλληνικάFrançaisYou Belong With Me Lyrics[Verse 1]\nYou're on the phone with your girlfriend, she's upset\nShe's going off about something that you said\n'Cause she doesn't get your humor like I do\nI'm in the room, it's a typical Tuesday night\nI'm listening to the kind of music she doesn't like\nAnd she'll never know your story like I do\n\n[Pre-Chorus]\nBut she wears short skirts, I wear T-shirts\nShe's Cheer Captain and I'm on the bleachers\nDreaming 'bout the day when you wake up and find\nThat what you're looking for has been here the whole time\n\n[Chorus]\nIf you could see that I'm the one who understands you\nBeen here all along, so why can't you see?\nYou belong with me, you belong with me\n\n[Verse 2]\nWalking the streets with you and your worn-out jeans\nI can't help thinking this is how it ought to be\nLaughing on a park bench, thinking to myself\nHey, isn't this easy?\nAnd you've got a smile that could light up this whole town\nI haven't seen it in a while since she brought you down\nYou say you're fine, I know you better than that\nHey, whatcha doing with a girl like that?\nSee Taylor Swift LiveGet tickets as low as $113You might also like[Pre-Chorus]\nShe wears high heels, I wear sneakers\nShe's Cheer Captain and I'm on the bleachers\nDreaming 'bout the day when you wake up and find\nThat what you're looking for has been here the whole time\n\n[Chorus]\nIf you could see that I'm the one who understands you\nBeen here all along, so why can't you see?\nYou belong with me\nStanding by and waiting at your back door\nAll this time, how could you not know, baby?\nYou belong with me, you belong with me\n\n[Bridge]\nOh, I remember you driving to my house\nIn the middle of the night\nI'm the one who makes you laugh\nWhen you know you're 'bout to cry\nAnd I know your favorite songs\nAnd you tell me 'bout your dreams\nThink I know where you belong\nThink I know it's with me\n\n[Chorus]\nCan't you see that I'm the one who understands you\nBeen here all along, so why can't you see?\nYou belong with me\nStanding by and waiting at your back door\nAll this time, how could you not know, baby?\nYou belong with me, you belong with me\n[Outro]\nYou belong with me\nHave you ever thought just maybe\nYou belong with me?\nYou belong with me97Embed"